/**
 * Master Controller
 */

angular.module('RDash')
    .controller('MasterCtrl', ['$scope', '$cookieStore', MasterCtrl])
    .controller('MapCtrl', ['$scope','gameService', MapCtrl])
    .controller('TableCtrl', ['$scope', TableCtrl])
    .service('gameService', function () {

        this.cityComputerAll = ['Аахен',
            'Абу-Даби',
            'Агадир',
            'Агиос-Николаос',
            'Аделаида',
            'Аджман',
            'Айя-Напа',
            'Акаба',
            'Акапулько',
            'Аккра',
            'Аланья',
            'Албена',
            'Александрия',
            'Алеппо',
            'Алжир',
            'Аликанте',
            'Алма-Ата (Алматы)',
            'Альмерия',
            'Амальфи',
            'Амман',
            'Амстердам',
            'Андора-Ла-Велья',
            'Анкара',
            'Анкона',
            'Анкоридж',
            'Анталия',
            'Антверпен',
            'Антиб',
            'Багдад',
            'Бад-Гаштайн',
            'Бад-Хофгаштайн',
            'Базель',
            'Баку',
            'Балчик',
            'Бангалор',
            'Бангкок',
            'Банско',
            'Бар',
            'Бари',
            'Барселона',
            'Бейрут',
            'Белград',
            'Белек',
            'Белосток',
            'Белфаст',
            'Бенидорм',
            'Берген',
            'Берлин',
            'Берн',
            'Бильбао',
            'Бирмингем',
            'Бишкек',
            'Бланес',
            'Богота',
            'Бодрум',
            'Бока-Чика',
            'Болонья',
            'Бонн',
            'Бордо',
            'Боровец',
            'Бостон',
            'Бразилиа',
            'Братислава',
            'Брашов',
            'Бремен',
            'Брест',
            'Брисбен',
            'Бристоль',
            'Брно',
            'Брюгге',
            'Брюссель',
            'Будапешт',
            'Будва',
            'Ванкувер',
            'Варадеро',
            'Варна',
            'Варшава',
            'Вашингтон',
            'Веллингтон',
            'Вена',
            'Венеция',
            'Верона',
            'Вильнюс',
            'Виннипег',
            'Висбаден',
            'Вифлеем',
            'Вроцлав',
            'Вьентьян',
            'Гент',
            'Генуя',
            'Герат',
            'Гетеборг',
            'Глазго',
            'Гоа',
            'Гонконг',
            'Гонолулу',
            'Гранада',
            'Гран-Канария',
            'Грац',
            'Гренобль',
            'Гуантанамо',
            'Гуанчжоу',
            'Гудаута',
            'Гулрыпш',
            'Далянь',
            'Дамаск',
            'Дананг',
            'Дар-эс-Салам',
            'Дахаб',
            'Дебрецен',
            'Дели',
            'Денпасар',
            'Детройт',
            'Джайпур',
            'Джакарта',
            'Джерба',
            'Джидда',
            'Дидим',
            'Днепропетровск',
            'Донецк',
            'Елените',
            'Ереван',
            'Загреб',
            'Задар',
            'Закинтос',
            'Закопане',
            'Зальбах-Хинтерглем',
            'Зальцбург',
            'Запорожье',
            'Зеефельд',
            'Зёльден',
            'Золотые Пески',
            'Иерусалим',
            'Измир',
            'Иматра',
            'Инсбрук',
            'Ираклион',
            'Исламабад',
            'Йокогама',
            'Йоханнесбург',
            'Кабул',
            'Кавала',
            'Кадис',
            'Каир',
            'Калгари',
            'Калифея',
            'Калькутта',
            'Кальяри',
            'Канберра',
            'Кандагар',
            'Канкун',
            'Канны',
            'Каппадокия',
            'Капри',
            'Каракас',
            'Карачи',
            'Карловы Вары',
            'Карлсруэ',
            'Касабланка',
            'Катания',
            'Кейптаун',
            'Кельн',
            'Кемер',
            'Керкира',
            'Киев',
            'Кито',
            'Китцбюэль',
            'Кишинев',
            'Клагенфурт',
            'Колимбия',
            'Лагос',
            'Лангкави',
            'Лансароте',
            'Ла-Пас',
            'Ла-Пинеда',
            'Ларнака',
            'Лас-Вегас',
            'Лас-Пальмас-де-Гран-Канария',
            'Лассити',
            'Лахти',
            'Лейпциг',
            'Ленгенфельд',
            'Ливерпуль',
            'Ливорно',
            'Лидс',
            'Лилль',
            'Лима',
            'Лимассол',
            'Линдос',
            'Линц',
            'Лион',
            'Лиссабон',
            'Ллорет-де-Мар',
            'Лодзь',
            'Лозанна',
            'Лондон',
            'Лос-Анджелес',
            'Луанда',
            'Лугано',
            'Луганск',
            'Майами',
            'Майорка',
            'Майрхофен',
            'Макади Бей',
            'Малага',
            'Мале',
            'Мальме',
            'Манавгат',
            'Манаус',
            'Манила',
            'Манчестер',
            'Марианские Лазни',
            'Марса-Алам',
            'Марсель',
            'Маскат',
            'Махдия',
            'Махмутлар',
            'Медина',
            'Мекка',
            'Мельбурн',
            'Мерида',
            'Мессина',
            'Мехико',
            'Мешхед',
            'Мииму атолл',
            'Милан',
            'Минск',
            'Мишкольц',
            'Нанкин',
            'Нант',
            'Нассау',
            'Неаполь',
            'Несебр',
            'Нетания',
            'Никосия',
            'Ницца',
            'Нови-Сад',
            'Новый Афон',
            'Новый Орлеан',
            'Нойштифт',
            'Нувейба',
            'Нью-Йорк',
            'Оломоуц',
            'Ольборг',
            'Ордино-Аркалис',
            'Орлеан',
            'Орхус',
            'Осака',
            'Осло',
            'Острава',
            'Оттава',
            'Оулу',
            'Охрид',
            'Очамчира',
            'Памуккале',
            'Панама',
            'Пардубице',
            'Париж',
            'Патры',
            'Паттайя',
            'Пафос',
            'Пекин',
            'Пелопоннес',
            'Пенанг',
            'Перт',
            'Пескара',
            'Пиза',
            'Пицунда',
            'Плайя-дель-Кармен',
            'Пловдив',
            'Пльзень',
            'Пномпень',
            'Раа атолл',
            'Рабат',
            'Равда',
            'Регенсбург',
            'Рейкьявик',
            'Реймс',
            'Ресифи',
            'Ретимно',
            'Рига',
            'Риека',
            'Рим',
            'Римини',
            'Рио-де-Жанейро',
            'Рованиеми',
            'Родос',
            'Росток',
            'Роттердам',
            'Санта-Круз-де-Тенерифе',
            'Санто-Доминго',
            'Сантьяго',
            'Сантьяго-де-Куба',
            'Сан-Франциско',
            'Санья',
            'Саппоро',
            'Сарагоса',
            'Сарыкамыш',
            'Сассари',
            'Сафага',
            'Святой Влас',
            'Себу',
            'Севастополь',
            'Севилья',
            'Сеул',
            'Сиэтл',
            'Тайбэй',
            'Таллин',
            'Тампере',
            'Таранто',
            'Таррагона',
            'Ташкент',
            'Тбилиси',
            'Тебриз',
            'Тегеран',
            'Тель-Авив',
            'Тенерифе',
            'Теплице',
            'Тиват',
            'Тирана',
            'Токио',
            'Томар',
            'Торонто',
            'Тосса-де-Мар',
            'Трабзон',
            'Триест',
            'Улан-Батор',
            'Урумчи',
            'Утрехт',
            'Ухань',
            'Фаафи атолл',
            'Фалираки',
            'Фамагуста',
            'Фанес',
            'Фантхьет',
            'Фару',
            'Фетхие',
            'Филадельфия',
            'Флоренция',
            'Фрайбург',
            'Франкфурт-на-Майне',
            'Фрипорт',
            'Хаа Алифу атолл',
            'Хайфа',
            'Хаммамет',
            'Ханой',
            'Ханья',
            'Харбин',
            'Харьков',
            'Хевиз',
            'Хельсинки',
            'Херсониссос',
            'Хошимин',
            'Хуа Хин',
            'Хургада',
            'Хьюстон',
            'Хэйхэ',
            'Цель-ам-Зее',
            'Церматт',
            'Цюрих',
            'Ченнаи',
            'Чешме',
            'Чиангмай',
            'Чикаго',
            'Чунцин',
            'Шанхай',
            'Шарджа',
            'Шарм-эль-Шейх',
            'Шеньжень',
            'Шеньян',
            'Штутгарт',
            'Щецин',
            'Эдинбург',
            'Эдмонтон',
            'Эйлат',
            'Эльблонг',
            'Эль-Гуна',
            'Эль-Пас-де-ла-Каса',
            'Эрзурум',
            'Эр-Рияд',
            'Ялиссос',
            'Янгон',
            'Яссы'];
        this.cityComputer = [];
        this.cityFromUser = [];
        this.cityAll = ["Москва", "Минск"];
        //console.log($scope);


        this.game = function (fromUser) {
            this.cityFromUser.push(fromUser);
            this.cityAll.push(fromUser);
            this.compucterStep(fromUser)
        };

        this.isCyrillic = function (text) {
            return /[а-я]/i.test(text);
        };

        this.checkCity = function (cityX) {
            if (this.isCyrillic(cityX)) {
                if (this.cityAll.indexOf(cityX) > 0) {
                    alert('Такой город уже был, введите другой')
                } else {
                    this.game(cityX);
                }
            } else {
                alert("Введите город на русском языке")
            }
        };

        this.compucterStep = function (fromUser) {
            var x = fromUser.slice(-1);
            if (x == "ъ" || x == "ь" || x == "ы") {
                x = fromUser.slice(-2, -1)
            }
            for (var i = 0; i < this.cityComputerAll.length; i++) {

                if (x === this.cityComputerAll[i].slice(0, 1).toLowerCase()) {
                    console.log("Есть");
                    this.cityComputer.push(this.cityComputerAll[i]);
                    this.cityAll.push(this.cityComputerAll[i]);
                    this.cityComputerAll.splice(i, 1);
                    break
                }else if(!this.cityComputerAll[i+1]){
                    alert("У компьютера нет вариантов...")
                }

            }

        };

    });
/*------------------------------------------------------------------------------*/
function TableCtrl($scope, gameService) {
    console.log($scope.cityAll)
}




function MapCtrl($scope, gameService) {
   /* $scope.cityComputerAll = gameService.cityComputerAll;
    $scope.cityComputer = gameService.cityComputer;
    $scope.cityFromUser = gameService.cityFromUser;
    $scope.cityAll = gameService.cityAll;
    $scope.game = gameService.game();
    $scope.checkCity = gameService.checkCity();
    $scope.compucterStep = gameService.compucterStep();
    $scope.isCyrillic = gameService.isCyrillic();*/
    $scope = gameService;


    $scope.map = ymaps.ready(function () {

        //Узнавать координаты
        /*  var myGeocoder = ymaps.geocode(cityX);
         myGeocoder.then(
         function (res) {
         console.log('Координаты объекта :' + res.geoObjects.get(0).geometry.getCoordinates());
         },
         function (err) {
         alert('Ошибка');
         }
         );
         console.log(myGeocoder);
         */

        // В функцию поступает пространство имен, которое содержит все запрощенные при инициализации модули.
        var myMap = new ymaps.Map('map', {
            center: [30, 20],
            zoom: 2
            // В данном примере карта создается без контролов, так как те не были загружены при инициализации API.

        });

        myMap.behaviors.disable('scrollZoom');
        myMap.controls.remove('searchControl');
        myMap.controls.remove('trafficControl');


    });


}
/*-----------------------------------*/
/*-----------------------------------*/
//-------/**/
/*--------*/








function MasterCtrl($scope, $cookieStore) {
    /**
     * Sidebar Toggle & Cookie Control
     */
    var mobileView = 992;

    $scope.getWidth = function () {
        return window.innerWidth;
    };

    $scope.$watch($scope.getWidth, function (newValue, oldValue) {
        if (newValue >= mobileView) {
            if (angular.isDefined($cookieStore.get('toggle'))) {
                $scope.toggle = !$cookieStore.get('toggle') ? false : true;
            } else {
                $scope.toggle = true;
            }
        } else {
            $scope.toggle = false;
        }

    });

    $scope.toggleSidebar = function () {
        $scope.toggle = !$scope.toggle;
        $cookieStore.put('toggle', $scope.toggle);
    };


    // console.log($scope);
    // console.log($cookieStore);

    window.onresize = function () {
        $scope.$apply();
    };
}